Revit 2027 API
DividedPath.SetIntersectingElements Method
 Set the elements whose intersection with path produces points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetIntersectingElements(
	ICollection<ElementId> intersectors
)
Public Sub SetIntersectingElements (
	intersectors As ICollection(Of ElementId)
)
public:
void SetIntersectingElements(
	ICollection<ElementId^>^ intersectors
)
member SetIntersectingElements :
        intersectors : ICollection<ElementId> -> unit
Parameters
intersectors ICollection<ElementId>
Exceptions
Exception | Condition
ArgumentException |  Not all intersecting elements in intersectors are valid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace